In [1]:
# Import module
import sqlite3

In [2]:
# Connecting to sqlite
conn = sqlite3.connect('stores.db')

In [3]:
#declare cursor
cursor= conn.cursor()

## 1. Write SQL query to create table Customers.

In [4]:
command="""CREATE TABLE Customers(customerNumber INTEGER PRIMARY KEY,
customerName VARCHAR(30),contactLastName VARCHAR(15),
contactFirstName VARCHAR(15),phone INTEGER(10),
addressLine1 VARCHAR(30),addressLine2 VARCHAR(30),
city CHAR(20),state CHAR(20),postalCode INTERGER(6),
country CHAR(20),saleRepEmployeeNumber INTEGER(30),creditlimit INTEGER(10));"""

In [5]:
cursor.execute(command)

In [26]:
sql_command = """INSERT INTO Customers VALUES 
(1, "Rishabh Bansal", "Bansal", "Rishabh",  0000000000,"Road No. 72", "Karkardooma", "East Delhi","Delhi", 110032, "INDIA", 101, 1000000),
(2, "Swati Juneja", "Juneja", "Swati",  1111111111, "ISBM", "Jagraon Bridge", "Ludhiana", "Punjab", 141008, "INDIA", 102, 1200000),
(3, "Arti Aggarwal", "Aggarwal", "Arti", 2222222222, "Road No 202", "Dwarka", "South Delhi",  "Delhi", 110075, "INDIA", 103, 3000000),
(4, "Vidyut Thakur", "Thakur", "Vidyut", 3333333333, "Preet Nagar", "Akalsar Road", "Moga","Punjab", 142001, "INDIA", 104, 5000000),
(5, "Rishabh Rathore", "Rathore", "Rishabh", 4444444444, "Cross Road", "Indiranagar", "Bengaluru","Karnataka", 560038, "INDIA", 105, 2000000),
(6, "Mahima Chaudhary", "Chaudhary", "Mahima", 5555555555, "Budhpur", "Alipur", "North Delhi", "Delhi", 110036, "INDIA", 106, 1800000),
(7, "Ritika Bansal", "Bansal", "Ritika", 6666666666,  "Santhusapet"," Bengaluru North", "Bengaluru","Karnataka", 560053, "INDIA", 107, 20000000),
(8, "Juhi Taneja", "Taneja", "Juhi", 7777777777,"Shahibabad", "Anand Vihar", "Ghaziabad", "UP", 201005, "INDIA", 108, 7000000),
(9,  "Sunita Chaudhary", "Chaudhary", "Sunita", 8888888888, "Sant Namdev Path", "Gokhale Road", "Thane", "Maharashtra", 400601, "INDIA", 109, 4000000),
(10, "Rudra Khurana", "Khurana", "Rudra", 9999999999, "B Block Road", "Preet Vihar", "East Delhi", "Delhi", 110092, "INDIA", 110, 1400000),
(11, "Vaibhav Aggarwal", "Aggarwal", "Vaibhav", 9125111111, "LPU", "Phagwara", "Kapurthala", "Punjab", 144401, "INDIA", 111, 50000000),
(12, "Mitali Bansal", "Bansal", "Mitali", 5252525252, "Shivaji Park", "Punjabi Bagh", "West Delhi", "Delhi", 110026, "INDIA", 112, 1500000),
(13, "Rishabh Rathore", "Rathore", "Rishabh", 8899995522, "Vijay Nagar Main Road", "Vijay Nagar", "Bengaluru", "Karnataka", 560040, "INDIA", 113, 25000000);"""

# execute the statement
cursor.execute(sql_command)

In [6]:
conn.commit()

## 2. Write SQL query to create table Orders.

In [7]:
command="""CREATE TABLE Orders(orderNumber INTEGER PRIMARY KEY,
orderDate DATE(10),requiredDate DATE(10),shippedDate DATE(10),
status CHAR(10),comments VARCHAR(30),customerNumber INTEGER(10),
FOREIGN KEY(customerNumber) REFERENCES Customers(customerNumber));"""

In [8]:
cursor.execute(command)

In [9]:
conn.commit()

In [10]:
command = """INSERT INTO Orders VALUES
(1, "2022-10-10", "2022-10-10", "2022-10-10", "Shipped", "Good", 1),
(2, "2022-10-10", "2022-10-10", "2022-10-10", "Dispatched", "Nice", 2),
(3, "2022-10-10", "2022-10-10", "2022-10-10", "In Transit", "Not Good", 3),
(4, "2022-10-10", "2022-10-10", "2022-10-10", "Delivered", "Awesome", 4),
(5, "2022-10-10", "2022-10-11", "2022-10-11", "Dispatched", "Perfect", 5),
(6, "2022-10-10", "2022-10-11", "2022-10-11", "In Transit", "Wrong Product", 6),
(7, "2022-10-11", "2022-10-11", "2022-10-11", "Shipped", "Defective", 7),
(8, "2022-10-11", "2022-10-11", "2022-10-11", "Dispatched", "Good", 8),
(9, "2022-10-11", "2022-10-11", "2022-10-11", "Dispatched", "Amazing", 9),
(10, "2022-10-11", "2022-10-12", "2022-10-12", "In Transit", "Bad", 10),
(11, "2022-10-11", "2022-10-12", "2022-10-12", "Delivered", "Good Quality", 11),
(12, "2022-10-11", "2022-10-13", "2022-10-12", "Dispatched", "Good Taste", 12),
(13, "2022-10-11", "2022-10-13", "2022-10-12", "Delivered", "Fast", 13);"""

In [11]:
cursor.execute(command)

## 3. Write SQL query to show all the columns data from the Orders Table.

In [12]:
sqlt="""SELECT * FROM Orders;"""
select= cursor.execute(sqlt)
for i in select:
    print(i)

(1, '2022-10-10', '2022-10-10', '2022-10-10', 'Shipped', 'Good', 1)
(2, '2022-10-10', '2022-10-10', '2022-10-10', 'Dispatched', 'Nice', 2)
(3, '2022-10-10', '2022-10-10', '2022-10-10', 'In Transit', 'Not Good', 3)
(4, '2022-10-10', '2022-10-10', '2022-10-10', 'Delivered', 'Awesome', 4)
(5, '2022-10-10', '2022-10-11', '2022-10-11', 'Dispatched', 'Perfect', 5)
(6, '2022-10-10', '2022-10-11', '2022-10-11', 'In Transit', 'Wrong Product', 6)
(7, '2022-10-11', '2022-10-11', '2022-10-11', 'Shipped', 'Defective', 7)
(8, '2022-10-11', '2022-10-11', '2022-10-11', 'Dispatched', 'Good', 8)
(9, '2022-10-11', '2022-10-11', '2022-10-11', 'Dispatched', 'Amazing', 9)
(10, '2022-10-11', '2022-10-12', '2022-10-12', 'In Transit', 'Bad', 10)
(11, '2022-10-11', '2022-10-12', '2022-10-12', 'Delivered', 'Good Quality', 11)
(12, '2022-10-11', '2022-10-13', '2022-10-12', 'Dispatched', 'Good Taste', 12)
(13, '2022-10-11', '2022-10-13', '2022-10-12', 'Delivered', 'Fast', 13)

## 4. Write SQL query to show all the comments from the Orders Table.

In [13]:
sqlc = """SELECT comments FROM Orders;"""
select= cursor.execute(sqlc)
for i in select:
    print(i)

('Good',)
('Nice',)
('Not Good',)
('Awesome',)
('Perfect',)
('Wrong Product',)
('Defective',)
('Good',)
('Amazing',)
('Bad',)
('Good Quality',)
('Good Taste',)
('Fast',)

## 5. Write a SQL query to show orderDate and Total number of orders placed on that date, from Orders table.

In [14]:
sqld = """SELECT date (orderDate), COUNT(*) FROM Orders GROUP BY date (orderDate);"""
select= cursor.execute(sqld)
for i in select:
    print(i)

('2022-10-10', 6)
('2022-10-11', 7)

## 6.Write a SQL query to show employeNumber, lastName, firstName of all the employees from employees table.

In [15]:
command=""" CREATE TABLE Employees( employeesNumber INTEGER PRIMARY KEY,
lastName VARCHAR(15),
firstName VARCHAR(15),
extension INTEGER(5),
email VARCAHR(30),
officeCode INTEGER(6),
reportsTo CHAR(20),
jobTitle CHAR(20));"""

In [16]:
cursor.execute(command)

In [17]:
command=""" INSERT INTO Employees VALUES
(101, "Verma", "Aman", 01, "Aman@gmail.com", 10000, "Manager", "Customer Service Representative"),
(102, "Dutta", "Tina", 02, "Tina@gmail.com", 10001, "Manager", "Cashier"),
(103, "Kapoor", "Meesha", 03, "Meesha@gmail.com", 10002, "Manager", "Sales Associate"),
(104, "Kumar", "Varun", 04, "Varun@gmail.com", 10003, "Manager", "Cashier"),
(105, "Dutt", "Kamal", 05, "Kamal@gmail.com", 10004, "Sr. Manager", "Sales Associate"),
(106, "Rana", "Dev", 06, "Dev@gmail.com", 10005, "Manager", "Sr. Manager");"""

In [18]:
cursor.execute(command)

In [19]:
conn.commit()

In [20]:
sqle="""SELECT employeesNumber, lastName, firstName FROM Employees;"""
select= cursor.execute(sqle)
for i in select:
    print(i)

(101, 'Verma', 'Aman')
(102, 'Dutta', 'Tina')
(103, 'Kapoor', 'Meesha')
(104, 'Kumar', 'Varun')
(105, 'Dutt', 'Kamal')
(106, 'Rana', 'Dev')

## 7.Write a SQL query to show all orderNumber, customerName of the person who placed the respective order.

In [27]:
sqlo="""SELECT Orders.orderNumber, Customers.customerName FROM Orders, Customers WHERE Orders.customerNumber = Customers.customerNumber;"""
select= cursor.execute(sqlo)
for i in select:
    print(i)

(1, 'Rishabh Bansal')
(2, 'Swati Juneja')
(3, 'Arti Aggarwal')
(4, 'Vidyut Thakur')
(5, 'Rishabh Rathore')
(6, 'Mahima Chaudhary')
(7, 'Ritika Bansal')
(8, 'Juhi Taneja')
(9, 'Sunita Chaudhary')
(10, 'Rudra Khurana')
(11, 'Vaibhav Aggarwal')
(12, 'Mitali Bansal')
(13, 'Rishabh Rathore')

## 8. Write a SQL query to show name of all the customers in one column and salerepemployee name in another column.

In [28]:
sql_command = """SELECT  Customers.customerName,  Employees.firstName || ' ' || lastName AS FullName  FROM Customers, Employees
WHERE Customers.saleRepEmployeeNumber = Employees.employeesNumber;"""
select= cursor.execute(sql_command)
for i in select:
    print(i)

('Rishabh Bansal', 'Aman Verma')
('Swati Juneja', 'Tina Dutta')
('Arti Aggarwal', 'Meesha Kapoor')
('Vidyut Thakur', 'Varun Kumar')
('Rishabh Rathore', 'Kamal Dutt')
('Mahima Chaudhary', 'Dev Rana')

## 9. Write a SQL query to show Date in one column and total payment amount of the payments made on that date from the payments table.

In [29]:
command=""" CREATE TABLE Payments(customerNumber INTEGER PRIMARY KEY,
checkNumber INTEGER NOT NULL UNIQUE,
paymentDate DATE(10),
amount INTEGER(15),
FOREIGN KEY (customerNumber) REFERENCES Customers (customerNumber));"""

In [30]:
cursor.execute(command)
conn.commit()

In [31]:
sql_command = """INSERT INTO Payments VALUES 
(1, 200025, "2022-10-10", 10000),
(2, 456854, "2022-10-10", 30000),
(3, 856584, "2022-10-11", 55000),
(4, 665544, "2022-10-11", 25000),
(5, 100054, "2022-10-12", 80000);"""

# execute the statement
cursor.execute(sql_command)
conn.commit()

In [61]:
sqlp=""" SELECT date(paymentDate), amount FROM Payments;"""
result=cursor.execute(sqlp)
for i in result:
    print(i)

('2022-10-10', 10000)
('2022-10-10', 30000)
('2022-10-11', 55000)
('2022-10-11', 25000)
('2022-10-12', 80000)

## 10. Write a SQL query to show all the products productName, MSRP, productDescription from the products table.

In [32]:
sql_command = """CREATE TABLE Products(
productCode INTEGER PRIMARY KEY,
productName VARCHAR(20),
productLine VARCHAR(15),
productScale VARCHAR(10),
productVendor VARCHAR(10),
productDescription VARCHAR(30),
quantityInStock VARCHAR(10),
buyPrice INTEGER(10),
MSRP INTEGER(10),
FOREIGN KEY (productLine) REFERENCES productLines (ProductLine));"""
cursor.execute(sql_command)

conn.commit()

In [33]:
sql_command = """INSERT INTO Products VALUES 
(1001, "Horlicks Health Drinks", "Growth + Horlicks", "6 out of 10 stars", "GlaxoSmithKline","Sweet malted milk hot drink powder", "20 Kg", 420, 450),
(1002, "Bournvita Health Drinks", "Bournvita Health Drink", "5 out of 10 stars", "Ayurveda Bazar Private Limited", "Malted chocolate drink mix", "15 Kg", 400, 420),
(1003, "Surf Excel Detergent", "Washing Powder by Unilever", "4.0 out of 5 stars",  "Hindustan Unilever Limited (HUL) and Unilever Sri Lanka", "First detergent powder of India and Pakistan", "30 Kg", 300, 320),
(1004, "Amul Fresh Milk", "Full Cream Milk", "4.3 out of 5 stars", "Gujarat Govt. Cooperative Society ", "Hygienic liquid milk", "50 ltr", 50, 50),
(1005, "Mother Dairy Fresh Milk", "Tonned Milk", "4.3 out of 5 stars", "Indian food company", "Wholesome and healthy", "50 ltr", 48, 48),
(1006, "Pepsodent Toothpaste", "American brand of toothpaste","4.5 out of 5 stars",  "American brand", "American brand of toothpaste with the minty flavor derived from sassafras", "1000 gms", 95, 100);"""

cursor.execute(sql_command)

conn.commit()

In [34]:
sql_command = """SELECT productName, MSRP, productDescription FROM Products;"""
select= cursor.execute(sql_command)
for i in select:
    print(i)

('Horlicks Health Drinks', 450, 'Sweet malted milk hot drink powder')
('Bournvita Health Drinks', 420, 'Malted chocolate drink mix')
('Surf Excel Detergent', 320, 'First detergent powder of India and Pakistan')
('Amul Fresh Milk', 50, 'Hygienic liquid milk')
('Mother Dairy Fresh Milk', 48, 'Wholesome and healthy')
('Pepsodent Toothpaste', 100, 'American brand of toothpaste with the minty flavor derived from sassafras')

## 11. Write a SQL query to print the productName, productDescription of the most ordered product.

In [35]:
sql_command = """CREATE TABLE OrderDetails(
orderNumber INTEGER PRIMARY KEY,
productCode INTEGER (10),
quantityOrdered VARCHAR(15),
priceEach INTEGER(15),
orderLineNumber INTEGER(10),
FOREIGN KEY (orderNumber) REFERENCES Orders (orderNumber),
FOREIGN KEY (productCode) REFERENCES Products (productCode));"""

cursor.execute(sql_command)

conn.commit()

In [36]:
sql_command = """INSERT INTO OrderDetails VALUES 
(1, 1001, "10 Kg", 400, "Growth + Horlicks"),
(2, 1002, "10 Kg", 300, "Bournvita Health Drink"),
(3, 1003, "20 Kg", 95, "Washing Powder by Unilever"),
(4, 1004, "50 ltr", 50, "Full Cream Milk"),
(5, 1005, "50 ltr", 48, "Tonned Milk"),
(6, 1006, "750 gms", 95, "American brand of toothpaste");"""


cursor.execute(sql_command)

conn.commit()

In [37]:
sql_command = """SELECT Products.productName, Products.productDescription, SUM(OrderDetails.quantityOrdered) AS quantityOrdered
FROM Products 
INNER JOIN OrderDetails
ON OrderDetails.productCode = Products.productCode 
GROUP BY OrderDetails.quantityOrdered ;"""
select= cursor.execute(sql_command)
for i in select:
    print(i)

('Horlicks Health Drinks', 'Sweet malted milk hot drink powder', 20.0)
('Surf Excel Detergent', 'First detergent powder of India and Pakistan', 20.0)
('Amul Fresh Milk', 'Hygienic liquid milk', 100.0)
('Pepsodent Toothpaste', 'American brand of toothpaste with the minty flavor derived from sassafras', 750.0)

## 12. Write a SQL query to print the city name where maximum number of orders were placed.

In [38]:
sql_command = """SELECT Customers.city, SUM(orderDetails.quantityOrdered) AS quantityOrdered 
FROM Customers 
INNER JOIN orderDetails, Orders
ON Customers.customerNumber = Orders.customerNumber and Orders.orderNumber = orderDetails.orderNumber
GROUP BY orderDetails.quantityOrdered ;"""
select= cursor.execute(sql_command)
for i in select:
    print(i)

('East Delhi', 20.0)
('South Delhi', 20.0)
('Moga', 100.0)
('North Delhi', 750.0)

## 13. Write a SQL query to get the name of the state having maximum number of customers.

In [39]:
sql_command = """SELECT state, COUNT(*) AS Max_Customer 
FROM Customers 
GROUP BY state
ORDER BY COUNT(*) DESC;"""
select= cursor.execute(sql_command)
for i in select:
    print(i)

('Delhi', 5)
('Punjab', 3)
('Karnataka', 3)
('UP', 1)
('Maharashtra', 1)

## 14. Write a SQL query to print the employee number in one column and Full name of the employee in the second column for all the employees

In [41]:
sql_command = """SELECT employeesNumber, firstName || ' ' || lastName AS fullName 
FROM Employees ;"""
select= cursor.execute(sql_command)
for i in select:
    print(i)

(101, 'Aman Verma')
(102, 'Tina Dutta')
(103, 'Meesha Kapoor')
(104, 'Varun Kumar')
(105, 'Kamal Dutt')
(106, 'Dev Rana')

## 15. Write a SQL query to print the orderNumber, customer Name and total amount paid by the customer for that order (quantityOrdered × priceEach).

In [43]:
sql_command = """SELECT OrderDetails.orderNumber, Customers.customerName, (OrderDetails.quantityOrdered  * OrderDetails.priceEach) AS Amount
FROM OrderDetails
INNER JOIN Customers, Orders
ON Customers.customerNumber = Orders.customerNumber and OrderDetails.orderNumber = Orders.orderNumber;"""
select= cursor.execute(sql_command)
for i in select:
    print(i)

(1, 'Rishabh Bansal', 4000)
(2, 'Swati Juneja', 3000)
(3, 'Arti Aggarwal', 1900)
(4, 'Vidyut Thakur', 2500)
(5, 'Rishabh Rathore', 2400)
(6, 'Mahima Chaudhary', 71250)